In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import copy
import math
import glob
import os
import seaborn as sns

In [2]:
path = r"/Users/Oh/Documents/CodeAcademyBerlin/bike_analysis/data/years_2010_to_2017"
all_files = glob.glob(os.path.join(path, "*.csv"))
all_files.sort() # Files are arranged already in correct alphabetical order in the folder, so we want to preserve the order.

df_from_each_file = (pd.read_csv(f) for f in all_files)
concatenated_df   = pd.concat(df_from_each_file, ignore_index=True)

Run time: 40 s

<h3> Dataframe with daily values </h3>
First, create a dataframe for keeping track of daily values. <br>
Further below, will create a df for hourly values.

In [3]:
# Create a dataframe for the daily values

df_all_years = concatenated_df.copy(deep = True)        # Want to preserve the original "concatenated_df"

In [4]:
df_all_years.head()

,Duration,Start date,End date,Start station number,Start station,End station number,End station,Bike number,Member type
0,1012,2010-09-20 11:27:04,2010-09-20 11:43:56,31208,M St & New Jersey Ave SE,31108,4th & M St SW,W00742,Member
1,61,2010-09-20 11:41:22,2010-09-20 11:42:23,31209,1st & N St SE,31209,1st & N St SE,W00032,Member
2,2690,2010-09-20 12:05:37,2010-09-20 12:50:27,31600,5th & K St NW,31100,19th St & Pennsylvania Ave NW,W00993,Member
3,1406,2010-09-20 12:06:05,2010-09-20 12:29:32,31600,5th & K St NW,31602,Park Rd & Holmead Pl NW,W00344,Member
4,1413,2010-09-20 12:10:43,2010-09-20 12:34:17,31100,19th St & Pennsylvania Ave NW,31201,15th & P St NW,W00883,Member

In [5]:
df_all_years['Start date'] = pd.to_datetime(df_all_years['Start date'])

In [6]:
df_all_years['End date'] = pd.to_datetime(df_all_years['End date'])

In [7]:

"""
# Remove the time. In this dataframe, we only want to keep track of daily values. 
df_all_years['Start date'] = df_all_years['Start date'].dt.date
"""

"\n# Remove the time. In this dataframe, we only want to keep track of daily values. \ndf_all_years['Start date'] = df_all_years['Start date'].dt.date\n"

In [8]:
df_all_years.head()

,Duration,Start date,End date,Start station number,Start station,End station number,End station,Bike number,Member type
0,1012,2010-09-20 11:27:04,2010-09-20 11:43:56,31208,M St & New Jersey Ave SE,31108,4th & M St SW,W00742,Member
1,61,2010-09-20 11:41:22,2010-09-20 11:42:23,31209,1st & N St SE,31209,1st & N St SE,W00032,Member
2,2690,2010-09-20 12:05:37,2010-09-20 12:50:27,31600,5th & K St NW,31100,19th St & Pennsylvania Ave NW,W00993,Member
3,1406,2010-09-20 12:06:05,2010-09-20 12:29:32,31600,5th & K St NW,31602,Park Rd & Holmead Pl NW,W00344,Member
4,1413,2010-09-20 12:10:43,2010-09-20 12:34:17,31100,19th St & Pennsylvania Ave NW,31201,15th & P St NW,W00883,Member

In [9]:
df_all_years.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19117643 entries, 0 to 19117642
Data columns (total 9 columns):
 #   Column                Dtype
---  ------                -----
 0   Duration              int64
 1   Start date            datetime64[ns]
 2   End date              datetime64[ns]
 3   Start station number  int64
 4   Start station         object
 5   End station number    int64
 6   End station           object
 7   Bike number           object
 8   Member type           object
dtypes: datetime64[ns](2), int64(3), object(4)
memory usage: 1.3+ GB

Select rows where Member type == 'Member' (i.e. 'registered') <br>
Then do groupby + agg to find total number of registered users per day

In [10]:
df_agg_registered = df_all_years [df_all_years['Member type'] == 'Member'].groupby(pd.Grouper(key = 'Start date', freq = 'D')).count().rename(columns={'Member type': 'Registered'})

In [11]:
df_agg_registered.head()

,Duration,End date,Start station number,Start station,End station number,End station,Bike number,Registered
Start date,,,,,,,,
2010-09-20,178,178,178,178,178,178,178,178
2010-09-21,215,215,215,215,215,215,215,215
2010-09-22,260,260,260,260,260,260,260,260
2010-09-23,249,249,249,249,249,249,249,249
2010-09-24,206,206,206,206,206,206,206,206

In [12]:
df_agg_registered.reset_index(inplace = True)

In [13]:
df_agg_registered.head()

,Start date,Duration,End date,Start station number,Start station,End station number,End station,Bike number,Registered
0,2010-09-20,178,178,178,178,178,178,178,178
1,2010-09-21,215,215,215,215,215,215,215,215
2,2010-09-22,260,260,260,260,260,260,260,260
3,2010-09-23,249,249,249,249,249,249,249,249
4,2010-09-24,206,206,206,206,206,206,206,206

In [14]:
df_agg_registered.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2660 entries, 0 to 2659
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Start date            2660 non-null   datetime64[ns]
 1   Duration              2660 non-null   int64
 2   End date              2660 non-null   int64
 3   Start station number  2660 non-null   int64
 4   Start station         2660 non-null   int64
 5   End station number    2660 non-null   int64
 6   End station           2660 non-null   int64
 7   Bike number           2660 non-null   int64
 8   Registered            2660 non-null   int64
dtypes: datetime64[ns](1), int64(8)
memory usage: 187.2 KB

In [15]:
df_agg_registered = df_agg_registered[['Start date', 'Registered']]

In [16]:
# This contains number of registered users for each day.
df_agg_registered

     Start date  Registered
0    2010-09-20         178
1    2010-09-21         215
2    2010-09-22         260
3    2010-09-23         249
4    2010-09-24         206
...         ...         ...
2655 2017-12-27        2934
2656 2017-12-28        2618
2657 2017-12-29        2744
2658 2017-12-30        1633
2659 2017-12-31        1321

[2660 rows x 2 columns]

Select rows where Member type == 'Casual' <br>
Then do groupby + agg to find total number of casual users per day

In [17]:
df_agg_casual = df_all_years [df_all_years['Member type'] == 'Casual'].groupby(pd.Grouper(key = 'Start date', freq = 'D')).count().rename(columns={'Member type': 'Casual'})

In [18]:
df_agg_casual = df_agg_casual.reset_index()

In [19]:
df_agg_casual = df_agg_casual [['Start date', 'Casual']]

In [20]:
df_agg_casual

     Start date  Casual
0    2010-09-20      34
1    2010-09-21     109
2    2010-09-22     117
3    2010-09-23     124
4    2010-09-24     156
...         ...     ...
2655 2017-12-27     387
2656 2017-12-28     248
2657 2017-12-29     344
2658 2017-12-30     243
2659 2017-12-31     116

[2660 rows x 2 columns]

In [21]:
df_all_agg_daily = pd.merge(df_agg_registered, df_agg_casual, how = 'outer', on = ['Start date'])

In [22]:
df_all_agg_daily = df_all_agg_daily.rename(columns = {'Start date': 'date', 
                                            'Registered': 'registered',
                                            'Casual': 'casual'})

In [23]:
df_all_agg_daily.head()

        date  registered  casual
0 2010-09-20         178      34
1 2010-09-21         215     109
2 2010-09-22         260     117
3 2010-09-23         249     124
4 2010-09-24         206     156

In [24]:
df_all_agg_daily.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2660 entries, 0 to 2659
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        2660 non-null   datetime64[ns]
 1   registered  2660 non-null   int64
 2   casual      2660 non-null   int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 83.1 KB

In [25]:
df_all_agg_daily.isna().sum()

date          0
registered    0
casual        0
dtype: int64

In [26]:
df_all_agg_daily['year'] = df_all_agg_daily['date'].dt.year
df_all_agg_daily['month'] = df_all_agg_daily['date'].dt.month
df_all_agg_daily['day'] = df_all_agg_daily['date'].dt.day_name()

In [27]:
df_all_agg_daily['day'] = df_all_agg_daily['day'].apply(lambda x: x[0:3])

In [28]:
df_all_agg_daily.head()

        date  registered  casual  year  month  day
0 2010-09-20         178      34  2010      9  Mon
1 2010-09-21         215     109  2010      9  Tue
2 2010-09-22         260     117  2010      9  Wed
3 2010-09-23         249     124  2010      9  Thu
4 2010-09-24         206     156  2010      9  Fri

Great. So now we have a dataframe with the following columns: <br>
date, total registered users, total casual users, year, month, day

Now we want to create the same kind of data, but on an hourly basis.

In [29]:
df_all_years_hourly = concatenated_df.copy(deep = True)

In [30]:
df_all_years_hourly.head()

,Duration,Start date,End date,Start station number,Start station,End station number,End station,Bike number,Member type
0,1012,2010-09-20 11:27:04,2010-09-20 11:43:56,31208,M St & New Jersey Ave SE,31108,4th & M St SW,W00742,Member
1,61,2010-09-20 11:41:22,2010-09-20 11:42:23,31209,1st & N St SE,31209,1st & N St SE,W00032,Member
2,2690,2010-09-20 12:05:37,2010-09-20 12:50:27,31600,5th & K St NW,31100,19th St & Pennsylvania Ave NW,W00993,Member
3,1406,2010-09-20 12:06:05,2010-09-20 12:29:32,31600,5th & K St NW,31602,Park Rd & Holmead Pl NW,W00344,Member
4,1413,2010-09-20 12:10:43,2010-09-20 12:34:17,31100,19th St & Pennsylvania Ave NW,31201,15th & P St NW,W00883,Member

In [31]:
df_all_years_hourly['Start date'] = pd.to_datetime(df_all_years_hourly['Start date'])

In [32]:
df_all_years_hourly['End date'] = pd.to_datetime(df_all_years_hourly['End date'])

In [33]:
df_all_years_hourly['hour'] = df_all_years_hourly['Start date'].dt.hour

In [34]:
df_all_years_hourly.head(5)

,Duration,Start date,End date,Start station number,Start station,End station number,End station,Bike number,Member type,hour
0,1012,2010-09-20 11:27:04,2010-09-20 11:43:56,31208,M St & New Jersey Ave SE,31108,4th & M St SW,W00742,Member,11
1,61,2010-09-20 11:41:22,2010-09-20 11:42:23,31209,1st & N St SE,31209,1st & N St SE,W00032,Member,11
2,2690,2010-09-20 12:05:37,2010-09-20 12:50:27,31600,5th & K St NW,31100,19th St & Pennsylvania Ave NW,W00993,Member,12
3,1406,2010-09-20 12:06:05,2010-09-20 12:29:32,31600,5th & K St NW,31602,Park Rd & Holmead Pl NW,W00344,Member,12
4,1413,2010-09-20 12:10:43,2010-09-20 12:34:17,31100,19th St & Pennsylvania Ave NW,31201,15th & P St NW,W00883,Member,12

In [35]:
#df_all_years_hourly['Start date'] = df_all_years_hourly['Start date'].dt.date

Select rows where Member type == 'Member' (i.e. 'registered') <br>
Then do groupby + agg to find total number of registered users per hour

In [36]:
df_agg_registered_hourly = df_all_years_hourly [df_all_years_hourly['Member type'] == 'Member'].groupby(pd.Grouper(key = 'Start date', freq = 'H')).count().rename(columns={'Member type': 'Registered'})

In [37]:
df_agg_registered_hourly = df_agg_registered_hourly[['Registered']]

In [38]:
df_agg_registered_hourly.head()

                     Registered
Start date
2010-09-20 11:00:00           2
2010-09-20 12:00:00          17
2010-09-20 13:00:00          11
2010-09-20 14:00:00           4
2010-09-20 15:00:00          10

In [39]:
df_agg_registered_hourly.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 63829 entries, 2010-09-20 11:00:00 to 2017-12-31 23:00:00
Freq: H
Data columns (total 1 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Registered  63829 non-null  int64
dtypes: int64(1)
memory usage: 997.3 KB

In [40]:
# This contains number of registered users for each day.
df_agg_registered_hourly

                     Registered
Start date
2010-09-20 11:00:00           2
2010-09-20 12:00:00          17
2010-09-20 13:00:00          11
2010-09-20 14:00:00           4
2010-09-20 15:00:00          10
...                         ...
2017-12-31 19:00:00          55
2017-12-31 20:00:00          30
2017-12-31 21:00:00          44
2017-12-31 22:00:00          21
2017-12-31 23:00:00          13

[63829 rows x 1 columns]

Select rows where Member type == 'Casual'  <br>
Then do groupby + agg to find total number of casual users per hour

In [41]:
df_agg_casual_hourly = df_all_years_hourly [df_all_years_hourly['Member type'] == 'Casual'].groupby(pd.Grouper(key = 'Start date', freq = 'H')).count().rename(columns={'Member type': 'Casual'})

In [42]:
df_agg_casual_hourly = df_agg_casual_hourly [['Casual']]

In [43]:
df_agg_casual_hourly.head()

                     Casual
Start date
2010-09-20 14:00:00       2
2010-09-20 15:00:00       2
2010-09-20 16:00:00       5
2010-09-20 17:00:00       2
2010-09-20 18:00:00       3

In [44]:
df_agg_casual_hourly.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 63826 entries, 2010-09-20 14:00:00 to 2017-12-31 23:00:00
Freq: H
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Casual  63826 non-null  int64
dtypes: int64(1)
memory usage: 997.3 KB

In [45]:
# This contains number of casual users for each day.
df_agg_casual_hourly

                     Casual
Start date
2010-09-20 14:00:00       2
2010-09-20 15:00:00       2
2010-09-20 16:00:00       5
2010-09-20 17:00:00       2
2010-09-20 18:00:00       3
...                     ...
2017-12-31 19:00:00       4
2017-12-31 20:00:00       0
2017-12-31 21:00:00       2
2017-12-31 22:00:00       4
2017-12-31 23:00:00       1

[63826 rows x 1 columns]

In [46]:
df_all_agg_hourly = pd.merge(df_agg_registered_hourly, df_agg_casual_hourly, how = 'outer', on = ['Start date'])

In [47]:
df_all_agg_hourly.head()
#df_all_agg_hourly[df_all_agg_hourly['Start date'] == '2011-01-01'].head(50)

                     Registered  Casual
Start date
2010-09-20 11:00:00           2     NaN
2010-09-20 12:00:00          17     NaN
2010-09-20 13:00:00          11     NaN
2010-09-20 14:00:00           4     2.0
2010-09-20 15:00:00          10     2.0

In [48]:
df_all_agg_hourly.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 63829 entries, 2010-09-20 11:00:00 to 2017-12-31 23:00:00
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Registered  63829 non-null  int64
 1   Casual      63826 non-null  float64
dtypes: float64(1), int64(1)
memory usage: 1.5 MB

In [49]:
df_all_agg_hourly.reset_index(inplace = True)

In [50]:
df_all_agg_hourly.head()

           Start date  Registered  Casual
0 2010-09-20 11:00:00           2     NaN
1 2010-09-20 12:00:00          17     NaN
2 2010-09-20 13:00:00          11     NaN
3 2010-09-20 14:00:00           4     2.0
4 2010-09-20 15:00:00          10     2.0

In [51]:
df_all_agg_hourly['hour'] = df_all_agg_hourly['Start date'].dt.hour

In [52]:
df_all_agg_hourly.head()

           Start date  Registered  Casual  hour
0 2010-09-20 11:00:00           2     NaN    11
1 2010-09-20 12:00:00          17     NaN    12
2 2010-09-20 13:00:00          11     NaN    13
3 2010-09-20 14:00:00           4     2.0    14
4 2010-09-20 15:00:00          10     2.0    15

In [53]:
df_all_agg_hourly['Start date'] = df_all_agg_hourly['Start date'].dt.date

In [54]:
df_all_agg_hourly.head()

   Start date  Registered  Casual  hour
0  2010-09-20           2     NaN    11
1  2010-09-20          17     NaN    12
2  2010-09-20          11     NaN    13
3  2010-09-20           4     2.0    14
4  2010-09-20          10     2.0    15

In [55]:
# But we know that NaN are all zeros. So:

df_all_agg_hourly['Registered'] = df_all_agg_hourly['Registered'].fillna(0)
df_all_agg_hourly['Casual'] = df_all_agg_hourly['Casual'].fillna(0)

In [56]:
df_all_agg_hourly.head()

   Start date  Registered  Casual  hour
0  2010-09-20           2     0.0    11
1  2010-09-20          17     0.0    12
2  2010-09-20          11     0.0    13
3  2010-09-20           4     2.0    14
4  2010-09-20          10     2.0    15

In [57]:
df_all_agg_hourly['Start date'] = pd.to_datetime(df_all_agg_hourly['Start date'])

In [58]:
df_all_agg_hourly['year'] = df_all_agg_hourly['Start date'].dt.year
df_all_agg_hourly['month'] = df_all_agg_hourly['Start date'].dt.month
df_all_agg_hourly['day'] = df_all_agg_hourly['Start date'].dt.day_name()
df_all_agg_hourly['day'] = df_all_agg_hourly['day'].apply(lambda x: x[0:3])

In [59]:
df_all_agg_hourly.head()

  Start date  Registered  Casual  hour  year  month  day
0 2010-09-20           2     0.0    11  2010      9  Mon
1 2010-09-20          17     0.0    12  2010      9  Mon
2 2010-09-20          11     0.0    13  2010      9  Mon
3 2010-09-20           4     2.0    14  2010      9  Mon
4 2010-09-20          10     2.0    15  2010      9  Mon

In [60]:
df_all_agg_hourly = df_all_agg_hourly.rename(columns = {'Start date': 'date',
                                    'Registered': 'registered',
                                    'Casual': 'casual'})

In [61]:
df_all_agg_daily.head()

        date  registered  casual  year  month  day
0 2010-09-20         178      34  2010      9  Mon
1 2010-09-21         215     109  2010      9  Tue
2 2010-09-22         260     117  2010      9  Wed
3 2010-09-23         249     124  2010      9  Thu
4 2010-09-24         206     156  2010      9  Fri

In [62]:
df_all_agg_daily ['year_month'] = df_all_agg_daily['date'].dt.to_period('M')
df_all_agg_hourly ['year_month'] = df_all_agg_hourly['date'].dt.to_period('M')

In [63]:
df_all_agg_daily.head()
df_all_agg_hourly.head()

        date  registered  casual  hour  year  month  day year_month
0 2010-09-20           2     0.0    11  2010      9  Mon    2010-09
1 2010-09-20          17     0.0    12  2010      9  Mon    2010-09
2 2010-09-20          11     0.0    13  2010      9  Mon    2010-09
3 2010-09-20           4     2.0    14  2010      9  Mon    2010-09
4 2010-09-20          10     2.0    15  2010      9  Mon    2010-09

In [64]:
df_all_agg_daily.info()
df_all_agg_hourly.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2660 entries, 0 to 2659
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        2660 non-null   datetime64[ns]
 1   registered  2660 non-null   int64
 2   casual      2660 non-null   int64
 3   year        2660 non-null   int64
 4   month       2660 non-null   int64
 5   day         2660 non-null   object
 6   year_month  2660 non-null   period[M]
dtypes: datetime64[ns](1), int64(4), object(1), period[M](1)
memory usage: 166.2+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 63829 entries, 0 to 63828
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        63829 non-null  datetime64[ns]
 1   registered  63829 non-null  int64
 2   casual      63829 non-null  float64
 3   hour        63829 non-null  int64
 4   year        63829 non-null  int64
 5   month       63829 non-null  int64
 6   day         63829 non-null  object
 7   year_month  63829 non-null  period[M]
dtypes: datetime64[ns](1), float64(1), int64(4), object(1), period[M](1)
memory usage: 3.9+ MB

In [65]:
# Export dataframes

df_all_agg_daily.to_csv('cleaned_data/df_all_agg_daily.csv', index = False)
df_all_agg_hourly.to_csv('cleaned_data/df_all_agg_hourly.csv', index = False)

In [66]:
df_all_years.head()

,Duration,Start date,End date,Start station number,Start station,End station number,End station,Bike number,Member type
0,1012,2010-09-20 11:27:04,2010-09-20 11:43:56,31208,M St & New Jersey Ave SE,31108,4th & M St SW,W00742,Member
1,61,2010-09-20 11:41:22,2010-09-20 11:42:23,31209,1st & N St SE,31209,1st & N St SE,W00032,Member
2,2690,2010-09-20 12:05:37,2010-09-20 12:50:27,31600,5th & K St NW,31100,19th St & Pennsylvania Ave NW,W00993,Member
3,1406,2010-09-20 12:06:05,2010-09-20 12:29:32,31600,5th & K St NW,31602,Park Rd & Holmead Pl NW,W00344,Member
4,1413,2010-09-20 12:10:43,2010-09-20 12:34:17,31100,19th St & Pennsylvania Ave NW,31201,15th & P St NW,W00883,Member

In [67]:
df_all_years = df_all_years.rename(columns = {'Duration': 'duration',
                                'Start date': 'start_date',
                                'End date': 'end_date',
                                'Start station number': 'start_station_number',
                                'Start station': 'start_station',
                                'End station number': 'end_station_number',
                                'End station': 'end_station',
                                'Bike number': 'bike_number',
                                'Member type': 'member_type'
                                })

Want to export df_all_years (full data set) <br>
But the export / import is taking so long. <br>
Maybe work with just 3 years' data first.

In [68]:
df_all_years.tail()

,duration,start_date,end_date,start_station_number,start_station,end_station_number,end_station,bike_number,member_type
19117638,277,2017-12-31 23:43:17,2017-12-31 23:47:54,31109,7th & T St NW,31118,3rd & Elm St NW,W21036,Member
19117639,399,2017-12-31 23:51:55,2017-12-31 23:58:35,31125,15th & W St NW,31110,20th St & Florida Ave NW,W23147,Casual
19117640,393,2017-12-31 23:55:19,2018-01-01 00:01:52,31209,1st & N St SE,31609,Maine Ave & 7th St SW,W20144,Member
19117641,1319,2017-12-31 23:57:42,2018-01-01 00:19:42,31102,11th & Kenyon St NW,31102,11th & Kenyon St NW,W20860,Member
19117642,266,2017-12-31 23:58:21,2018-01-01 00:02:48,31229,New Hampshire Ave & T St NW,31119,14th & Belmont St NW,W01459,Member

<h3> Quick comparison of missing addresses with unique addresses from 2017 </h3>

<h5> Starts here </h5>

In [69]:
df_2017 = df_all_years[df_all_years['start_date'].dt.year == 2017]

In [70]:
df_2017_stations = df_2017['start_station'].unique()

In [71]:
print(list(df_2017_stations))

['3rd & Tingey St SE', 'Lincoln Memorial', 'Henry Bacon Dr & Lincoln Memorial Circle NW', '13th & H St NE', 'Adams Mill & Columbia Rd NW', 'Prince St & Union St', '14th & R St NW', 'Market Square / King St & Royal St', '3rd & H St NE', 'Lamont & Mt Pleasant NW', '17th & G St NW', '12th & U St NW', '14th & V St NW', 'Court House Metro / 15th & N Uhle St ', 'New Hampshire Ave & T St NW', '5th St & Massachusetts Ave NW', 'Ballston Metro / N Stuart & 9th St N', '15th & K St NW', '11th & M St NW', '1st & Rhode Island Ave NW', '1st & O St NW', 'M St & Pennsylvania Ave NW', '15th & P St NW', '14th & L St NW', '10th & K St NW', '7th & T St NW', '3rd & Elm St NW', 'Convention Center / 7th & M St NW', 'New Jersey Ave & R St NW', '15th & Euclid St  NW', '8th & O St NW', '14th & Girard St NW', 'Lincoln Park / 13th & East Capitol St NE ', '16th & Irving St NW', '3rd & H St NW', 'Henry St & Pendleton St', '18th St & Wyoming Ave NW', '6th & K St NE', '16th & Harvard St NW', '14th St & New York Ave NW', 'King St Metro North / Cameron St', '15th & East Capitol St NE', 'King St & Patrick St', '14th & G St NW', 'Saint Asaph & Madison St', '14th & Rhode Island Ave NW', 'Ripley & Bonifant St', '3rd & M St NE', 'Potomac & Pennsylvania Ave SE', '14th St & Spring Rd NW', 'Tenleytown / Wisconsin Ave & Albemarle St NW', '11th & S St NW', 'Park Rd & Holmead Pl NW', 'Hamlin & 7th St NE', 'Columbus Circle / Union Station', 'Kennedy Center', '16th & R St NW', '13th & D St NE', '6th St & Indiana Ave NW', '21st & M St NW', 'Eastern Market Metro / Pennsylvania Ave & 7th St SE', '17th & K St NW', 'Massachusetts Ave & Dupont Circle NW', '34th & Water St NW', '4th & M St SW', 'Jefferson Dr & 14th St SW', '2nd & G St NE', 'California St & Florida Ave NW', '11th & F St NW', '7th & R St NW / Shaw Library', '17th St & Massachusetts Ave NW', '14th & Harvard St NW', '10th & U St NW', '21st St N & N Pierce St', 'Eastern Market / 7th & North Carolina Ave SE', '17th & Corcoran St NW', '17th & K St NW / Farragut Square', 'Columbia Rd & Belmont St NW', "L'Enfant Plaza / 7th & C St SW", 'Florida Ave & R St NW', '1st & K St SE', '5th & K St NW', '11th & Kenyon St NW', 'Jefferson Memorial', '14th & Upshur St NW', 'D St & Maryland Ave NE', 'Thomas Circle', '4th & E St SW', 'Calvert St & Woodley Pl NW', '10th & Florida Ave NW', '20th St & Florida Ave NW', '6th & H St NE', '6th & S Ball St', '11th & H St NE', 'Virginia Square Metro / N Monroe St & 9th St N', '18th & R St NW', 'Georgia & New Hampshire Ave NW', '7th & F St NW / National Portrait Gallery', '20th & O St NW / Dupont South', 'North Capitol St & G Pl NE', '39th & Veazey St NW', 'Washington & Independence Ave SW/HHS', 'Wisconsin Ave & Newark St NW', '9th & Upshur St NW', '2nd St & Massachusetts Ave NE', '20th & L St NW', 'Metro Center / 12th & G St NW', '14th & Belmont St NW', 'Connecticut Ave & Newark St NW / Cleveland Park', 'Columbia Pike & S Courthouse Rd', 'Eckington Pl & Q St NE', '5th & Kennedy St NW', '1st & N St  SE', 'New Hampshire Ave & 24th St NW', '22nd St & Constitution Ave NW', '20th & E St NW', 'N Randolph St & Fairfax Dr', '4th & East Capitol St NE', '12th St & Pennsylvania Ave SE', 'John McCormack Dr & Michigan Ave NE', 'Maryland Ave & E St NE', 'Georgetown Harbor / 30th St NW', '47th & Elm St', '22nd & P ST NW', 'N Rhodes & 16th St N', '3rd St & Pennsylvania Ave SE', 'Good Hope Rd & 14th St SE', '14th & Irving St NW', '3000 Connecticut Ave NW / National Zoo', '3rd & G St SE', 'New York Ave & 15th St NW', 'N Quincy St & Glebe Rd', '20th & Crystal Dr', 'US Dept of State / Virginia Ave & 21st St NW', '25th St & Pennsylvania Ave NW', '14th & D St SE', 'Army Navy Dr & S Nash St', '24th & N St NW', 'N Veitch  & 20th St N', 'Washington Blvd & 10th St N', '15th & F St NE', 'Vermont Ave & I St NW', '12th & Irving St NE', 'Connecticut & Nebraska Ave NW', '4th & C St SW', 'Lee Hwy & N Cleveland St', 'Ohio Dr & West Basin Dr SW / MLK & FDR Memorials', 'Columbia Rd & Georgia Ave NW', 'Westpark & Jones Branch Dr', 'Potomac Ave & Main Line Blvd', '8th & D St NW', 'Key Blvd & N Quinn St', 'Georgia Ave and Fairmont St NW', '3rd & D St SE', 'Oklahoma Ave & D St NE', 'S Joyce & 16th St S', '26th & S Clark St', 'Rhode Island Ave & V St NE', 'Clarendon Blvd & Pierce St', 'North Capitol St & F St NW', 'Wisconsin Ave & O St NW', 'Hains Point/Buckeye & Ohio Dr SW', '8th & F St NE', 'Iwo Jima Memorial/N Meade & 14th St N', 'Wilson Blvd & N Quincy St', '28th St S & S Meade St', 'Wilson Blvd & N Edgewood St', 'USDA / 12th & Independence Ave SW', 'New York Ave & Hecht Ave NE', 'S Glebe & Potomac Ave', 'Georgia Ave & Spring St', 'River Rd & Landy Ln', 'Utah St & 11th St N ', '18th St & Rhode Island Ave NE', 'S Kenmore & 24th St S', 'Potomac Greens Dr & Slaters Ln', 'S Walter Reed Dr & 8th St S', 'New Jersey Ave & N St NW/Dunbar HS', '1st & M St NE', 'Columbia Pike & S Walter Reed Dr', '8th & East Capitol St NE', 'Pleasant St & MLK Ave SE', 'TJ Cmty Ctr / 2nd St & S Old Glebe Rd', 'Constitution Ave & 2nd St NW/DOL', '14th St Heights / 14th & Crittenden St NW', 'Battery Ln & Trolley Trail', 'M St & New Jersey Ave SE', 'Carroll & Ethan Allen Ave', '11th & O St NW', 'Monroe Ave & Leslie Ave', 'Bethesda Ave & Arlington Rd', 'Tysons Corner Station', 'N Lynn St & Fairfax Dr', 'Anacostia Metro', '22nd & I St NW / Foggy Bottom', 'Glebe Rd & 11th St N', '8th & Eye St SE / Barracks Row', '19th & East Capitol St SE', 'Potomac Ave & 35th St S', '4th St & Madison Dr NW', 'Central Library / N Quincy St & 10th St N', '13th St & New York Ave NW', 'Commerce St & Fayette St', '18th St & Pennsylvania Ave NW', 'Fenton St & Ellsworth Dr ', 'C & O Canal & Wisconsin Ave NW', '1st & H St NW', 'Lee Hwy & N Woodstock St', '19th St & Constitution Ave NW', '15th St & Massachusetts Ave SE', 'Duke St & John Carlyle St', 'Union Market/6th St & Neal Pl NE', '8th & H St NW', '5th & F St NW', 'S Troy St & 26th St S', '15th & L St NW', 'Fairfax Dr & Wilson Blvd', '1st & D St SE', '19th St & Pennsylvania Ave NW', "10th St & L'Enfant Plaza SW", 'Gallaudet / 8th St & Florida Ave NE', 'Shirlington Transit Center / S Quincy & Randolph St', 'Crystal City Metro / 18th & Bell St', '12th & Army Navy Dr', '19th & E Street NW', '10th & Monroe St NE', 'Potomac Ave & 8th St SE', '20th St & Virginia Ave NW', 'Offutt Ln & Chevy Chase Dr', '18th & M St NW', '21st St & Constitution Ave NW', 'Smithsonian-National Mall / Jefferson Dr & 12th St SW', 'N Pershing Dr & Wayne St', 'Lee Hwy & N Scott St', '15th & N Scott St', 'Franklin & S Washington St', 'Connecticut Ave & Yuma St NW', 'Good Hope & Naylor Rd SE', '12th & L St NW', '23rd & Crystal Dr', 'Shady Grove Metro West', '10th & E St NW', '34th St & Wisconsin Ave NW', '18th & C St NW', '15th & Crystal Dr', 'Maple & Ritchie Ave', 'Rhode Island Ave Metro', 'S Arlington Mill Dr & Campbell Ave', 'East West Hwy & 16th St', '1st & Washington Hospital Center NW', 'Good Hope Rd & MLK Ave SE', 'Long Bridge Park/Long Bridge Dr & 6th St S', 'Powhatan St & Bashford Ln', 'Mount Vernon Ave & E Nelson Ave', 'Rhode Island & Connecticut Ave NW', 'East Falls Church Metro/Sycamore St & 19th St N', '17th St & Independence Ave SW', '19th & L St NW', 'Randle Circle & Minnesota Ave SE', 'Ward Circle / American University', 'Monroe St & Monroe Pl', 'Columbia Pike & S Dinwiddie St / Arlington Mill Community Center', "Independence Ave & L'Enfant Plaza SW/DOE", 'Bladensburg Rd & Benning Rd NE', 'Lynn & 19th St North', '10th St & Constitution Ave NW', 'Lee Hwy & N Kirkwood Rd', 'Braddock Rd Metro', '39th & Calvert St NW / Stoddert', 'Wilson Blvd & Franklin Rd', 'Benning Rd & East Capitol St NE / Benning Rd Metro', '10th & G St NW', 'Calvert & Biltmore St NW', 'Pershing & N George Mason Dr', '4th & W St NE', 'George Mason Dr & Wilson Blvd', 'Bethesda Metro', 'Westpark & Park Run Dr', 'Montgomery Ave & Waverly St ', 'Royal & Wilkes St', 'Commonwealth Ave & Oak St', 'Harvard St & Adams Mill Rd NW', 'Eads & 22nd St S', 'Anacostia Ave & Benning Rd NE / River Terrace ', 'Madison & Fairfax St', '37th & O St NW / Georgetown University', 'Rosslyn Metro / Wilson Blvd & Ft Myer Dr', 'Connecticut Ave & Chevy Chase Lake Dr', 'Takoma Metro', '14th St & Colorado Ave NW', 'Maine Ave & 7th St SW', 'Mount Vernon Ave & E Del Ray Ave', 'King Farm Blvd & Pleasant Dr', 'Lee Hwy & N Adams St', 'Barcroft Community Center', 'Norfolk Ave & Fairmont St', 'Wilson Blvd & N Uhle St', 'Mount Vernon Ave & Bruce St', '14th & D St NW / Ronald Reagan Building', 'S Joyce & Army Navy Dr', 'Walter Reed Community Center / Walter Reed Dr & 16th St S', '24th & R St NE / National Arboretum', 'Potomac & Swann Ave', 'Kennebec St & 11th St N', 'Ballenger Ave & Dulaney St', '23rd & E St NW ', 'Aurora Hills Community Ctr/18th & Hayes St', '19th & G St NW', 'Neal St & Trinidad Ave NE', 'Radford & Osage St', 'Eisenhower Ave & Mill Race Ln', 'Friendship Hts Metro/Wisconsin Ave & Wisconsin Cir', 'New Jersey Ave & L St NW', 'Washington Blvd & Walter Reed Dr ', 'Sunset Hills & Old Reston Ave', 'Arlington Blvd & N Queen St', 'Connecticut Ave & Tilden St NW', 'Solutions & Greensboro Dr', 'Barton St & 10th St N', 'Clarendon Blvd & N Fillmore St', 'S Four Mile Run & Walter Reed Dr', 'Carroll & Westmoreland Ave', 'Fenton St & New York Ave ', 'Mount Vernon Ave & Kennedy St', 'Saint Asaph St & Pendleton  St', 'Pentagon City Metro / 12th & S Hayes St', 'Yuma St & Tenley Circle NW', 'Medical Center Metro ', 'Fairfax Village', 'Arlington Blvd & Fillmore St', 'Georgia Ave & Emerson St NW', '13th St & Eastern Ave', 'Fessenden St & Wisconsin Ave NW', 'Commonwealth & E Monroe Ave', '36th & Calvert St NW / Glover Park', 'Van Ness Metro / UDC', '21st & I St NW', 'S Stafford & 34th St S', 'King St Metro South', 'Clarendon Metro / Wilson Blvd & N Highland St', 'Norfolk & Rugby Ave', 'Minnesota Ave Metro/DOES', 'McKinley St & Connecticut Ave NW', 'Fort Totten Metro', '21st St & Pennsylvania Ave NW', '19th & K St NW', 'Washington Blvd & 7th St N', 'King Farm Blvd & Piccard Dr', 'Fenton St & Gist Ave', 'Washington Blvd & N Frederick St', 'Georgia & Missouri Ave NW', 'N Veitch & Key Blvd', '12th & Newton St NE', 'Congress Heights Metro', 'Anacostia Library', 'S Four Mile Run Dr & S Shirlington Rd', 'Alabama & MLK Ave SE', 'Wisconsin Ave & Brandywine St NW', 'Woodmont Ave & Strathmore St', '18th & Eads St.', 'Division Ave & Foote St NE', 'Columbia Pike & S Orme St', 'Friendship Blvd & Willard Ave', 'East West Hwy & Blair Mill Rd', 'Silver Spring Metro/Colesville Rd & Wayne Ave', 'Cordell & Norfolk Ave', 'Wilson Blvd & N Illinois St ', '27th & Crystal Dr', '4th & D St NW / Judiciary Square', 'Madison & N Henry St', 'Wisconsin Ave & Ingomar St NW', 'Arlington Blvd & S George Mason Dr/NFATC', 'Fairfax Dr & Kenmore St', 'Reston Town Center Transit Station', 'Piccard & W Gude Dr', 'Crabbs Branch Way & Calhoun Pl', 'Philadelphia & Maple Ave', 'Montgomery & East Ln', 'Old Georgetown Rd & Southwick St', 'Carlin Springs Rd & N Thomas St', 'Lee Hwy & N Monroe St', 'Rockville Metro West', 'Spring St & Second Ave', 'Mount Vernon Ave & Four Mile Run Park', '31st & Woodrow St S', 'Benning Branch Library', 'Sligo Ave & Carroll Ln', 'Pennsylvania & Minnesota Ave SE', 'Dennis & Amherst Ave', 'Eads St & 15th St S', '16th & Q St SE / Anacostia HS', 'Fallsgrove Blvd & Fallsgrove Dr', 'Rolfe St & 9th St S', 'Reston Station', 'Rockville Metro East', 'Crabbs Branch Way & Redland Rd', 'Nannie Helen Burroughs Ave & 49th St NE', 'Branch & Pennsylvania Ave SE', 'New Dominion Pkwy & Fountain Dr', 'S George Mason Dr & 13th St S', 'Lee Center', 'Traville Gateway Dr & Gudelsky Dr', 'Jones Branch & Westbranch Dr', 'Lyttonsville Rd & Lyttonsville Pl', 'S George Mason Dr & Four Mile Run', '3rd St & Riggs Rd NE', 'Frederick Ave & Horners Ln', 'Veterans Pl & Pershing Dr ', '15th & W St NW', 'South Capitol & Atlantic St SW', 'Tysons One Pl & Chain Bridge Rd', 'E Montgomery Ave & Maryland Ave', '61st St & Banks Pl NE', 'Pooks Hill Rd & Linden Ave', 'Nannie Helen Burroughs & Minnesota Ave NE', 'Washington Adventist U / Flower Ave & Division St', 'Temporary Rd & Old Reston Ave', 'Fallsgrove Dr & W Montgomery Ave', 'Tysons West Transit Center', 'Fleet St & Ritchie Pkwy', 'North Shore & Cameron Crescent Dr/Crescent Apartments', 'Taft St & E Gude Dr', 'S Oakland St & Columbia Pike', 'Library St & Freedom Dr', 'Towers Crescent Dr & Tysons One Pl', 'Key West Ave & Siesta Key Way', 'Medical Center Dr & Key West Ave', 'Spring Hill Metro', 'Westpark Dr & Leesburg Pike', 'Sunset Hills Rd & Discovery Square', 'Greensboro & International Dr', 'Needwood Rd & Eagles Head Ct', 'Montgomery College/W Campus Dr & Mannakee St', 'Town Center Pkwy & Bowman Towne Dr', 'Reston YMCA', 'Shady Grove Hospital', 'Broschart & Blackwell Rd', 'Deanwood Rec Center', 'Takoma Park Rec Center', 'New Hampshire & Kirklynn Ave', 'North Shore Dr & Village Rd', 'Reston Regional Library', 'Amherst Ave & Elkins St', 'Wheaton Metro/Georgia Ave & Reedie Dr', 'Amherst Ave & Prichard Rd', 'Grandview & Blueridge Ave', 'Windham Ln & Amherst Ave', '3rd & Underwood St NW', '18th & Monroe St NE', 'Georgia Ave & Piney Branch Rd NW', '7th & E St SW', '31st & Water St NW', 'Sunset Hills Rd & Isaac Newton Square', 'Shady Grove Metro East', 'Potomac & M St NW', 'Town Center Pkwy & Sunset Hills Rd', 'Columbia & Ontario Rd NW', 'Westover Library / Washington Blvd & N McKinley Rd', 'Washington-Lee High School / N Stafford St & Generals Way', 'Reston Pkwy & Spectrum Dr', 'Columbia Pike & S Taylor St', 'Columbus Ave & Tribeca St', 'Columbus Ave & Gramercy Blvd', 'Key West Ave & Great Seneca Hwy', 'Virginia Ave & 25th St NW', '15th & M St NW', '2nd St & Seaton Pl NE', '11th & Girard St NW', 'Connecticut Ave & R St NW', 'Wilson Blvd & N Troy St', '15th St & Constitution Ave NW', 'Nebraska Ave/AU East Campus', '22nd & H St NW', '23rd & M St NW', 'Corporate Blvd & Omega Dr', 'Key West Ave & Diamondback Dr', '4th St & Mississippi Ave SE', 'Alabama Ave & Stanton Rd SE / Shops at Park Village', 'Livingston Rd & 3rd St SE', 'Mississippi Ave & 19th St SE / THEARC', '15th St & Pennsylvania Ave NW/Pershing Park', '1st & S Capitol St SE / Oxon Run Trail', '19th & Savannah St SE', '37th & Ely Pl SE / Fort Dupont Ice Arena', 'Joliet St & MLK Ave SW/Bald Eagle Rec Ctr', 'Maine Ave & 9th St SW', 'Lincoln Rd & Seaton Pl NE/Harry Thomas Rec Center']

In [72]:
missing_addresses = ['Crystal City Metro / 18th & Bell St', '21st & M St NW', 'Eastern Market Metro / Pennsylvania Ave & 7th St SE', 
'Connecticut Ave & Newark St NW / Cleveland Park',
'18th & Eads St.',
'19th & L St NW',
'23rd & Crystal Dr',
'Aurora Hills Community Ctr/18th & Hayes St',
'S Joyce & Army Navy Dr',
'Georgia Ave and Fairmont St NW',
'20th & Crystal Dr', 
'S Glebe & Potomac Ave',
'USDA / 12th & Independence Ave SW',
'27th & Crystal Dr',
'Pentagon City Metro / 12th & S Hayes St',
'12th & Army Navy Dr',
'26th & S Clark St',
'15th & Crystal Dr',
'Eads & 22nd St S',
'1st & N St  SE',
'Lynn & 19th St North',
'N Rhodes & 16th St N',
'Rosslyn Metro / Wilson Blvd & Ft Myer Dr',
'Wilson Blvd & Franklin Rd',
'11th & H St NE']

included = 0
missing = 0
for station in missing_addresses:
    if station in list(df_2017_stations):
        included += 1
    else:
        missing +=1

included, missing

(25, 0)

<h5> Ends here </h5>

In [73]:
df_2011 = df_all_years[df_all_years['start_date'].dt.year == 2011]
df_2012 = df_all_years[df_all_years['start_date'].dt.year == 2012]
df_2013 = df_all_years[df_all_years['start_date'].dt.year == 2013]
df_2014 = df_all_years[df_all_years['start_date'].dt.year == 2014]
df_2015 = df_all_years[df_all_years['start_date'].dt.year == 2015]
df_2016 = df_all_years[df_all_years['start_date'].dt.year == 2016]
df_2017 = df_all_years[df_all_years['start_date'].dt.year == 2017]

In [74]:
df_all_years.to_csv('cleaned_data/df_all_years.csv', encoding = 'utf-8', index = False)

Run time: 1m 48 s

In [75]:
df_2011.to_csv('cleaned_data/df_2011.csv', encoding = 'utf-8', index = False)
df_2012.to_csv('cleaned_data/df_2012.csv', encoding = 'utf-8', index = False)
df_2013.to_csv('cleaned_data/df_2013.csv', encoding = 'utf-8', index = False)
df_2014.to_csv('cleaned_data/df_2014.csv', encoding = 'utf-8', index = False)
df_2015.to_csv('cleaned_data/df_2015.csv', encoding = 'utf-8', index = False)
df_2016.to_csv('cleaned_data/df_2016.csv', encoding = 'utf-8', index = False)
df_2017.to_csv('cleaned_data/df_2017.csv', encoding = 'utf-8', index = False)